```
Nama : 
Batch : 
Objective : Latihan dalam kelas sebagai catatan pembelajaran mengenai data processing dengan pandas.
```

# Exercise

Terdapat 7 Case yang akan kita bahas untuk data processing hari ini,
yang meliputi data loading, data explore, data cleaning dan data transform.

## Data Loading

In [86]:
# Import library 
import pandas as pd 
import numpy

# Load data
df

,Year,Month,Day,Location,Country,Latitude,Longitude,EQ
0,2010,1,NaN,Ecuador,Ecuador,-1.467,-78.442,NaN
1,2010,3,31.0,Iceland-S,Iceland,63.630,-19.620,NaN
2,2010,5,27.0,Guatemala,Guatemala,14.381,-90.601,NaN
3,2010,5,29.0,Mariana Is-C Pacific,United States,16.708,145.780,EQ
4,2010,8,6.0,Sangihe Is-Indonesia,Indonesia,2.780,125.480,NaN

## Data Explore

Berikut list column yang ada pada data.csv 
.........

In [ ]:
# Code untuk list column

In [88]:
# Data Explore
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       15 non-null     int64
 1   Month      15 non-null     int64
 2   Day        14 non-null     float64
 3   Location   15 non-null     object
 4   Country    15 non-null     object
 5   Latitude   15 non-null     float64
 6   Longitude  15 non-null     float64
 7   EQ         3 non-null      object
dtypes: float64(3), int64(2), object(3)
memory usage: 1.1+ KB

## Data Cleaning

### Missing Data

In [115]:

# ? CASE 1 Data CSV

# ! 1. Deleting Rows

# ! 1. Deleting Column


# ? CASE 2 Data Score
df = pd.DataFrame({
  "name": ['Ayu', 'Yuda', 'Sapta', 'John'],
  "score": [90, 80, None, 60]
})
# ! 2. Filling Missing Values

# ! 3. Interpolated


#  ? CASE 3 Data Sales
df = pd.DataFrame({
  "saller": ["John", "Doe", "Jean", "Foo", "Bar", "Lorem", "Ipsum", "Dorom", "Hello", "World"] ,
  "total": [1000, None, 4000, None, 1000, None, 8000, 1000, 2000, 2000],
  "sale": [False, None, False, None, False, True, None, True, True, False],
})

# ! 4. Forward Fill


# ! 4. Back Fill


# ! 5. Imputation

### Data Duplicate

In [131]:

# ! CASE 4 Volcano Data
# Keep only the first data found.
df = pd.read_csv("volcano_data_2010.csv")


# ! CASE 5 Student Score 
# Data duplikat adalah data hasil reattempt test
#  dan data yang diambil adalah nilai terakhir.
df = pd.DataFrame({
 "name": ["Ayu", "Sapta", "Yuda", "Sapta", "Yuda", "Sapta", "Sapta"],
 "score": [50, 50, 50, 60 ,60, 70, 70]
})

Before : 80
After : 63

    name  score
0    Ayu     50
4   Yuda     60
6  Sapta     70

## Data Transform

In [152]:

# ! CASE 6 Data Transaction
data = {
    'Order_ID': [101, 102, 103, 104, 105],
    'Date': ['2023-07-15', '2023-07-16', '2023-07-17', '2023-07-18', '2023-07-19'],
    'Customer_ID': ['C001', 'C002', 'C003', 'C004', 'C005'],
    'Product': ['Laptop', 'Keyboard', 'Monitor', 'Mouse', 'Headphones'],
    'Quantity': ['1', '2', '3', '4', '5'],
    'Price': ['$1000.50', '$250.25', '$350.75', '$75.20', '$120.99'],
    'Sale_Status': ['True', 'True', 'True', 'False', 'False']
}

df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Order_ID     5 non-null      int64
 1   Date         5 non-null      object
 2   Customer_ID  5 non-null      object
 3   Product      5 non-null      object
 4   Quantity     5 non-null      object
 5   Price        5 non-null      object
 6   Sale_Status  5 non-null      object
dtypes: int64(1), object(6)
memory usage: 412.0+ bytes

In [153]:
# Change data format & data type here

   Order_ID       Date Customer_ID     Product  Quantity    Price  Sale_Status
0       101 2023-07-15        C001      Laptop         1  1000.50         True
1       102 2023-07-16        C002    Keyboard         2   250.25         True
2       103 2023-07-17        C003     Monitor         3   350.75         True
3       104 2023-07-18        C004       Mouse         4    75.20         True
4       105 2023-07-19        C005  Headphones         5   120.99         True

In [155]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Order_ID     5 non-null      int64
 1   Date         5 non-null      datetime64[ns]
 2   Customer_ID  5 non-null      object
 3   Product      5 non-null      object
 4   Quantity     5 non-null      int64
 5   Price        5 non-null      float64
 6   Sale_Status  5 non-null      bool
dtypes: bool(1), datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 377.0+ bytes

# OOP

Studi case ke 7 menggunakan dataset Travel Insurance.  

Path file :  
https://colab.research.google.com/github/FTDS-learning-materials/phase-0/blob/main/w2/P0W2D4PM_Data_Processing_and_Python_Scripting.ipynb#scrollTo=DVH76PNWKtlY

In [ ]:
import pandas as pd
import sys

class DataProcessor:
  pass